/* scripts/powers-library.js */
window.SuperheroesPowersLibrary = [
  {
    name: "Огненный Шар",
    folder: "Контроль Элементов",
    cost: 15,
    description: "Персонаж швыряет сгусток пламени. Наносит урон огнем."
  },
  {
    name: "Невидимость",
    folder: "Илюзия",
    cost: 20,
    description: "Персонаж становится невидимым для невооруженного глаза на 10 минут."
  },
  {
    name: "Мощный Удар",
    folder: "Супер-Сила",
    cost: 0,
    description: "Усиленный удар рукой без затрат фокуса."
  }
  // Добавляй новые так же, не забывая запятую между скобками }, {
  // Названия папок пиши ТОЧНО ТАК ЖЕ, чтобы скрипт клал их в одни и те же папки.
];