/* scripts/traits-library.js */
window.SuperheroesTraitsLibrary = [
  {
    name: "Боевая готовность",
    description: "Персонаж всегда морально готов к проблемам. Добавьте 30 Фокуса."
  },
  {
    name: "Привлекательный",
    description: "У персонажа преимущество при проверках Эго для убеждения кого-то, кому он может нравиться."
  },
  {
    name: "Жёсткий",
    description: "Персонаж умеет убеждать неправильным способом. Это даёт ему помеху при проверках Эго, для убеждения, в просьбах помочь. Это даёт ему преимущество при проверках Эго, в попытках кого-то запугать."
  },
  {
    name: "Берсерк",
    description: "Персонаж часто теряет контроль над гневом. Каждый раз, когда он получает физический урон, персонаж должен совершить проверку Эго со Сложностью, равной нанесённому урону. При провале, он становится берсерком и должен на полной скорости влететь в битву с врагом, который его ранил. Берсерк получает преимущество ко всем атакам Силы и добавляет +2 к защитам Силы, Выносливости и Эго. Однако, у него -2 от защиты Ловкости и он не может использовать оружие дальнего боя. Если персонаж побеждает врага, который его ранил, он должен устремиться атаковать следующего ближайшего врага. В конце хода персонажа, он теряет 5 Фокуса. Когда Фокус уменьшен настолько, что персонаж не может его терять добровольно — или когда в зоне видимости нет врагов — состояние берсерка автоматически заканчивается."
  },
  {
    name: "Большой",
    description: "Размер персонажа большой, что отнимает -1 от защит Силы и Ловкости, добавляет +1 к Скорости Бега, и увеличивает Досягаемость до 2. Персонаж всё ещё занимает одно пространство."
  },
  {
    name: "Кровожадный",
    description: "Персонажу нравится ранить людей — и даже их убивать. Когда он доводит кого-то до бессознательного состояния, он должен совершить Испытывающую (10+ранг) проверку Эго, чтобы не продолжить избивать цель до смерти."
  },
  {
    name: "Врач",
    description: "У персонажа преимущество в проверках Логики, для того, чтобы определить, что не так с кем-то, с медицинской точки зрения."
  },
  {
    name: "Невнимательный",
    description: "Персонажу сложно фокусироваться на одной вещи. У него помеха на любой проверке Бдительности, с целью заметить спрятанные или невидимые вещи. У врагов будет преимущество на проверках Ловкости, при попытках прокрасться мимо него."
  },
  {
    name: "Боевой эксперт",
    description: "Персонаж умеет держаться лучше многих. У него преимущество на атаках Силы против врагов 1 ранга."
  },
  {
    name: "Связи",
    description: "Персонаж знает кого-то с доступом в определённые области, или знаниями о них. Связью может выступать репортёр, полицейский, политик, гангстер и так далее. Проверкой Эго, персонаж может позвонить и попросить помощи в уликах, информации или ресурсах. Рассказчик определяет Сложность проверки Эго, в зависимости от просьбы. Эту черту можно выбрать несколько раз, используя разные варианты. Например: Знаменитости, Общественность, Преступность, Шпионаж, Военные, Изгои, Полиция, Профессионалы, Супергерои и так далее."
  },
  {
    name: "Делец",
    description: "Персонаж хорош в искусстве переговоров. У него Преимущество на проверках действия, которые связаны с заключением сделок."
  },
  {
    name: "Решительный",
    description: "Персонаж никогда не сдаётся, даже когда ему очень плохо. Когда он деморализован, у него нет помех на действиях, однако, персонаж всё ещё не может держать концентрацию или тратить фокус."
  },
  {
    name: "Фотографическая память",
    description: "Персонаж редко что-то забывает. Если игрок что-то забыл, он может попросить Рассказчика ему напомнить."
  },
  {
    name: "Выносливый",
    description: "Персонаж может функционировать до двух суток без сна, и у него преимущество на проверках Выносливости, чтобы побороть усталость или сонливость."
  },
  {
    name: "Улучшенное Телосложение",
    description: "Персонаж сильнее обычных людей. Считайте, что он на размер больше в вопросах поднимания, перетаскивания, размахивания и бросков вещей. (С другими факторами не складывается.). Также у него Преимущество на небоевых проверках Силы."
  },
  {
    name: "Знаменитый",
    description: "Персонаж широко известен — по крайней мере, среди определённых групп или населения. Он может быть любим многими, или ненавидим, но в любом случае, он знаменит. У персонажа преимущество в проверках Эго при убеждении кого-то, кто относится к нему хорошо. И помеха в проверках Эго при убеждении кого-то, кто относится к нему плохо. Если у персонажа есть Тайна Личности, эта черта работает только с одним его воплощением. Впрочем, черту можно взять несколько раз для разных личностей."
  },
  {
    name: "Бесстрашный",
    description: "Персонаж невероятно храбрый. У него преимущество в любой проверке, на преодоление страха."
  },
  {
    name: "Первая помощь",
    description: "Персонаж умеет оказывать первую помощь. У него преимущество в проверках Логики при попытках остановить кровотечение."
  },
  {
    name: "Акробат",
    description: "У персонажа преимущество в проверках Ловкости на акробатические трюки в действие движения."
  },
  {
    name: "Свежий взгляд",
    description: "У персонажа свой способ разбираться с делами. Зачастую, он кажется странным окружающим, но также это может принести новую перспективу в решении проблем. У него преимущество в проверках Логики, когда он сталкивается с чем-то впервые."
  },
  {
    name: "Техник",
    description: "Персонаж умеет обращаться с механизмами. У него преимущество в проверках Логики, чтобы понять принцип работы машины."
  },
  {
    name: "Болтливый",
    description: "Персонаж может завязать диалог с любым в любое время, и даже часто убеждает его помочь. У персонажа преимущество в проверках Эго на убеждение кого-то, с кем он разговаривает впервые."
  },
  {
    name: "Божественное Наследие",
    description: "Персонаж, или по крайней мере один из его предков — бог. Выберите, бог чего конкретно. Ему не обязательно быть богом чего-то известного. Вообще, он может быть богом чего-то совершенно нового. Однако, он не может быть богом чего-то, что уже занято кем-то из его пантеона. Другие боги часто ревнивы в вопросах своей области и не любят подобное соперничество. У персонажа Преимущество, когда он разбирается с чем-то, чего он бог. Ограничение: Эту черту может выбрать только персонаж с Мифическим происхождением, который является частью конкретного пантеона, вроде Асгардского или Олимпийского."
  },
  {
    name: "Доверчивый",
    description: "Персонажа легко одурачить. У обманывающих его персонажей преимущество в проверках Эго для убеждения в чём-то."
  },
  {
    name: "Честный",
    description: "Персонаж — отвратительный лжец. У него помеха каждый раз, когда он совершает проверку Эго, включающую в себя ложь. Однако, у него преимущество в любой дружеской проверке Эго (убеждение.), когда говорит правду."
  },
  {
    name: "Дознаватель",
    description: "Персонаж знает, как правильно задавать правильные вопросы. У него преимущество в проверках Эго или Логики, когда он допрашивает."
  },
  {
    name: "Изобретатель",
    description: "Персонаж хорошо находит решения налету. У него преимущество в проверках Логики при создании или починке вещей."
  },
  {
    name: "Следователь",
    description: "Персонаж — превосходный следователь. У него преимущество в проверках Бдительности, чтобы искать улики, и в Логике, чтобы их правильно понимать. Если в этот момент у него есть доступ к криминалистической лаборатории, у него будет второе преимущество."
  },
  {
    name: "Железная Воля",
    description: "У врагов помеха на попытках контролировать разум персонажа, или повлиять на его поведение. Также, у персонажа преимущество в проверках при попытках вырваться из контроля разума или другого влияния."
  },
  {
    name: "Знаток Законов",
    description: "Персонаж знает законы родины и может просвещать других. У персонажа преимущество в проверках Логики, когда он разбирается с законами."
  },
  {
    name: "Монстр",
    description: "Персонаж — монстр, зачастую, из легенд. У него преимущество при запугивании."
  },
  {
    name: "Не в форме",
    description: "Персонаж в слабой физической форме. Он считается на размер меньше при попытках перенести, размахивать или бросать вещи."
  },
  {
    name: "Пилот",
    description: "Персонаж умеет управлять транспортом любого вида. У него преимущество на проверках Ловкости при управлении транспортом во время действия движения. Это относится к машинам, лодкам, самолётам и так далее."
  },
  {
    name: "Умеющий привлечь внимание",
    description: "Персонаж знает, как призвать к вниманию, или его потребовать. У него преимущество в проверках Эго, что подразумевают обращение внимания на персонажа, или добровольную помощь персонажу."
  },
  {
    name: "Оратор",
    description: "Персонаж умеет получать внимание толпы, будь то политические сборы, перед судьёй или в классе. У него преимущество на проверках Эго при попытках убедить группу."
  },
  {
    name: "Обозреватель",
    description: "Персонаж умеет создавать новости и преподносить в таком контексте, чтобы развивать из них историю. У него преимущество на бросках Эго или Логики, когда он высказывает своё мнение в медиа."
  },
  {
    name: "Быстро учится",
    description: "Если персонаж проваливает проверку действия, у него будет преимущество на проверке в следующий ход, если он попробует совершить это же действие."
  },
  {
    name: "Научная экспертиза",
    description: "У персонажа продвинутая научная подготовка. При научных исследованиях, на проверках Логики у него будет преимущество. Если в этот момент у него есть доступ к подходящей лаборатории, у него будет второе преимущество."
  },
  {
    name: "Коронная атака",
    description: "Персонаж известен тем, что предпочитает конкретный вид оружия или атакующую способность. При таких атаках, у него преимущество. Эту черту можно взять больше раза, но каждый раз она должна применяться к разному типу оружия или атакующей способности."
  },
  {
    name: "Бдительный",
    description: "Персонаж обучен держать ухо востро. У него преимущество при проверках инициативы."
  },
  {
    name: "Скептик",
    description: "Персонажа сложно обмануть. У людей, которые им врут — помеха на проверках Эго в попытках убедить персонажа в чём-то."
  },
  {
    name: "Небольшой",
    description: "Размер персонажа небольшой, что прибавляет +1 к защитам Силы и Ловкости и отнимает -1 от Скорости Бега."
  },
  {
    name: "Пронырливый",
    description: "У персонажа преимущество в проверках Ловкости, при попытках прокрасться. У врагов помеха в проверках Бдительности, при попытках найти персонажа, когда он прячется или невидим."
  },
  {
    name: "Опора на технику",
    description: "Персонаж в способностях опирается на технологии. Когда он получает урон, что приводит его к бессознательному состоянию, он может вместо этого лишиться своих завязанных на технологиях способностей, и остаться в сознании с 1 очком Здоровья. Если у персонажа есть доступ к запчастям и инструментам для починки, потерянные способности он может вернуть после битвы."
  },
  {
    name: "Слабость",
    description: "Персонаж уязвим к определённому типу урона или материалу. Любая атака такого типа или с таким материалом — игнорирует все уменьшения множителей урона и урон не может быть восполнен Исцеляющим Фактором."
  },
  {
    name: "Странный",
    description: "В персонаже есть нечто странное (или даже чудесное.). Из-за этого, люди реагируют на персонажа ярче, что положительно, что отрицательно. У персонажа преимущество на всех проверках Эго при убеждении того, кому они нравится, и помеха на всех проверках Эго, против людей, которым он не нравится."
  }
];